# Set global configuration arguments
cask_args appdir: "/Applications"

# Taps
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"

# System set up
brew "bat"
brew "colordiff"
brew "git"
brew "fd"

# Fonts
cask "font-meslo-lg-nerd-font"  # Used for vim-devicons plugin

# Programming languages / Development
#brew "mysql"
#brew "node"
#brew "python"
#brew "python3"
#brew "pyenv"
#brew "yarn"

# Shell
brew "fzf"
brew "neovim", args: ['HEAD']
brew "ripgrep"
brew "thefuck"
brew "tmux"

# Install applications
cask "notion"
cask "rectangle"
cask "spotify"
cask "sublime-merge"
cask "visual-studio-code-insiders"

# Install MAS applications
#mas "Spark", id: 1176895641
